{
    "post1":{
        "post_date": "2025-11-20",
        "title": "Gachiakuta",
        "author": "Manga series written and drawn by Kei Urana, 2022",
        "paragraphs": [
            "This is Ms. Urana's first major published series for Weekly Shonen magazine. It's about a boy named Rudo, who gets framed for murder and is thrown out from his hometown. A mysterious floating island where the rich live behind a wall and the poor in the slums. He finds himself on the earth and soon discovers that it is full of garbage the sky people throw down. These mountains of garbage end up creating these giant garbage monsters that terrorize the people living on the surface.",
            "With nowhere to go Rudo joins a group called the “Cleaners” who fight these monsters using special abilities harnessed through their “jinki”. Which is a special object they must care for deeply for many years before it gives them magical powers. ",
            "There is a big emphasis on the importance of taking care of the environment. The heavy levels of pollution down on the surface has made life very difficult for the people on the surface. Meanwhile the ultra rich live on a floating island and keep carelessly throwing their trash down to earth.",
            "Rudo himself is someone who cares deeply about the “discarded” things others throw away. He finds value in the garbage dumps that litter his neighborhood and discovers that his own “jinki” is related to recycling things.", "Kei Urana has a very good fashion sense that is reflected in her character design. The main attraction I had for this series was the art direction. Gackiakuta has this cool “urban-punk” look. When I saw the cover for the first two volumes in the book store I just had to read it."
        ]
    },

    "post2":{
        "post_date": "2025-11-21",
        "title": "I'm Thinking of Ending Things",
        "author": "Novel by Ian Reid, 2016",
        "paragraphs": [
            "This story is told from our protagonist's point of view, a woman who is thinking about breaking up with her boyfriend Jake. We get this very intimate view into her and Jake's relationship which really helps bring these characters to life. She first introduces herself as Lucy, but throughout the story you find that her name keeps changing, which adds to the mystery.",
            "This is what you might call “social anxiety horror”. Everyone Lucy meets seems to be acting a little off, but you just can't really explain why. First it's the long awkward drive to his Jake's family's house deep in the countryside. When she gets there she meets his parents for the first time. That's when she notices odd things. How Jake's parents dress, the awkward silences, the facial expressions and mannerisms of random people she meets at the gas station. It creates a very surreal atmosphere.",
            "One of the most terrifying things I have ever read was the “man at the window” chapter. One night Lucy wakes up to see an impossible tall man standing in front of her window. So tall only his chest is visible.",
            "When I first picked up this book I was thinking: “what is up with this title?”. Now am I not going to outright explain the ending but… I think it's pretty bad. The whole book was building up all this mystery and tension, and then in the end its explanation of what really happened roughly boils down to “it was all just a dream”!!!",
            "The reason this book's ending makes me angry is because the beginning of the book was just so good! I was hooked in the first chapter. If you like psychological horror, something a little more philosophical and existential I think you might like this, just be warned it has a very rough ending."
        ]
    },

    "post3":{
        "post_date": "2025-11-23",
        "title": "Land of the Lustrous",
        "author": "Manga series by Haruko Ichikawa, 2012",
        "paragraphs": [
            "This is a series about a small island community of people made up of gems. During the day they have to defend themselves from the lunarians. Cloud people who want to break them and take their pieces to use as jewelry. During the day they come out of these giant rorschach ink plots in the sky.",
            "Our main character is named Phosphophyllite, who is made of the same green mineral. They're the youngest among their peers at only 300 years old and seen as clumsy and fragile by the others. The story explores themes of personnel change and growth through Phos's journey to uncover the mysteries behind the lunarians.",
            "We get to meet a vast array of colorful characters, each of them is named after a different gem. It is really unique because of how the properties of each gem affect their personality. You have a Diamond whose attitude shines bright and cheerful. Bort, who's gloomy, has an abrasive personality and a short temper. Cinnabar, which according to wikipedia is made of the “bright scarlet to brick-red form of mercury sulfide”. This causes them to stay away from others due to the toxic effects of mercury.",
            "Cool fact: Amethyst 84 and 33 are two twins, a reference to “Japan Law Twinning”. A phenomena where 2 pieces of quartz join together at an angle of 84 degrees and 33 minutes (1 minute is 1/60 degrees)."
        ]
    },

    "post4":{
        "post_date": "2025-11-24",
        "title": "Hitch Hiker's Guide to the Galaxy",
        "author": "Book series by Douglas Adams, 1978",
        "paragraphs": [
            "A classic of science fiction and humor. A story full of clever and  ludicrous humor. The earth gets destroyed to make space for a giant space highway. Leaving our main character Arthur Dent as one of the last two humans alive. Thankfully right before earth's destruction he was saved by his friend Ford Prefect. A jobless actor on earth, Ford turns out to be an alien in disguise.",
            "Arthur now finds himself in an absurd world full of aliens and crazy technology. Yet even in a space faring intergalactic civilisation there still exists the monotony of bureaucracy and the need to work a 9 to 5. Like in this universe God would just be a normal salary man up in heaven who needs to lead a normal life just like the rest of us.",
            "It feels timeless and strangely modern. When I read it you could still relate a lot with the characters and the jokes still land. For example you have Marvin, a robot who is the smartest computer in the world but is always depressed. At one point Arthur finds out that you can fly if you stop thinking long enough. It turns out that dolphins are smarter than humans and were able to leave earth before it was destroyed. And who can forget the famous number 42, which is the answer to the question: “what is the meaning of life”. It's a fun read and if you like absurd, random and dry humor I think you would like this book."
        ]
    }
}